# include<stdio.h>

/**
1. 全局静态变量
	1) 在全局分配内润
	2) 如果没有初始化, int类型整型值为0
	3) 改变量在文件内从定义开始到文件结束可见
	 
2. 局部静态变量
	1) 该变量在全局数据区分配内存
	2) 始终驻留在全局数据区，直到程序运行结束
	3) 其作用于为局部作用于，当定义它的函数或语句
		块结束时，其作用于随之结束
*/

void fn(){
	
	int n = 10;
	printf("n=%d \n",n);
	n++;
	printf("n++=%d",n);
}

void fn_static(){
	static int n = 10;
	
	printf("static n = %d \n",n);
	n++;
	printf("static n++ = %d \n",n);
}

int	 main(){
	fn();
	printf("-------------------------------------\n");
	fn_static();
	printf("-------------------------------------\n");	
	
	fn();
	printf("-------------------------------------\n");
	fn_static();
	printf("-------------------------------------\n");	
	
	return 0;
}